EDT/УТ/src/Documents/Рейс/Рейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рейс</name>
  <registerRecords>InformationRegister.РейсыЗаказов</registerRecords>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТипыТранспортовВероут</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалетты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РейсМестнойДоставки</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>axi_Загрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленноеЗакрытиеРейса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_РаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодикаМаршрутизации</name>
    <type>
      <types>EnumRef.МетодикаЛогистическойМаршрутизации</types>
    </type>
  </attributes>
  <attributes>
    <name>РольРейса</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаРейса</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДоставок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаборов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасположения</name>
      <type>
        <types>EnumRef.ТипыРасположенияТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяВремяОтправления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеРасстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическийПробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияПоПлану</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапланированнаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяУбытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>CatalogRef.СтатусыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗаказа</name>
      <type>
        <types>EnumRef.ВидыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВРучную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдаленИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженИзВероут</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальнаяМаршрутизация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВЗапланированныйРейс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поездки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоездки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДистанция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяПродолжительностьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяНачалаПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяОкончанияПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/CommonModules/МаршрутизацияЗаказовКлиент/Module.bsl
Процедура ВыбратьЭкипажДляРейса(Рейс, ДатаПланирования, Транспорт, ТекущийВодитель, ТекущийЭкспедитор, ФормаВладелец, ЭлементФормыДляОбновления = Неопределено) Экспорт
	Фрм = ПолучитьФорму("Документ.Рейс.Форма.ФормаВыбораТранспорта", Новый Структура("РежимВыбора, ДатаРейса, Транспорт", Истина, КонецДня(ДатаПланирования), Транспорт), ФормаВладелец);
	Струк = Фрм.ОткрытьМодально();
	Если ЗначениеЗаполнено(Струк) Тогда
		
		ВыбТранспорт = Струк.Транспорт;
		ВыбВодитель = Струк.Водитель;
		ВыбЭкспедитор = Струк.Экспедитор;
		ВыбРейс = Струк.Рейс;
		ПоменятьМестами = Струк.ПоменятьМестами;
		
		ТекущийТранспорт = Транспорт;
		
		//ТекущийТранспорт = Элементы.Список.ТекущиеДанные.ПривязанныйТранспорт;
		//ТекущийВодитель = Элементы.Список.ТекущиеДанные.ПривязанныйВодитель;
		//ТекущийЭкспедитор = Элементы.Список.ТекущиеДанные.ПривязанныйЭкспедитор;
		
		//+++ БАО 09.08.2017 №1606
		Если ЗначениеЗаполнено(ВыбТранспорт) И ЗначениеЗаполнено(Рейс) Тогда
			
			Струк = Новый Структура;
			Струк.Вставить("Транспорт", ВыбТранспорт);
			
			Попытка
				
				ПараметрыТранспорта = МаршрутизацияЗаказовСервер.ПрочитатьДополнительныеПараметрыТранспорта(ВыбТранспорт);
				
				Если ПараметрыТранспорта = Неопределено Тогда
					УдаленноеЗакрытиеРейсов = Ложь;
				Иначе	
					УдаленноеЗакрытиеРейсов = ПараметрыТранспорта.УдаленноеЗакрытие;
				КонецеСли;	
				
				//РейсОбъект = Рейс.ПолучитьОбъект();
				//РейсОбъект.УдаленноеЗакрытиеРейса = УдаленноеЗакрытиеРейсов;
				//РейсОбъект.Записать();
				МаршрутизацияЗаказовСервер.УстановитьДляРейсаПризнакУдаленногоЗакрытия(Рейс, УдаленноеЗакрытиеРейсов);
				Если ЭлементФормыДляОбновления <> Неопределено Тогда
					ЭлементФормыДляОбновления.Обновить();
				КонецЕсли;	
				
			Исключение
				
				Сообщить("Ошибка установки реквизита Удаленное закрытие рейса. Действие отменено. Попробуйте еще раз.");
				Возврат;
				
			КонецПопытки;	
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ВыбТранспорт) Тогда
			КолПопыток = 1;
			ПривязкаВыполнена = Ложь;
			Пока КолПопыток < 4 Цикл		
				Попытка
					МаршрутизацияЗаказовСервер.ПривязатьДанныеПоРейсуКЗаборамНаСервере(Рейс, ВыбТранспорт, ВыбВодитель, ВыбЭкспедитор);
					МаршрутизацияЗаказовСервер.ПривязатьМашинунаСервере(Рейс, ВыбТранспорт, ВыбВодитель, ВыбЭкспедитор);
					КолПопыток = 4;
					ПривязкаВыполнена = Истина;
					Продолжить;	
				Исключение
					КолПопыток = КолПопыток + 1;
				КонецПопытки;
			КонецЦикла;	
			
			Если НЕ ПривязкаВыполнена Тогда	
				Сообщить("Привязка не выполнена!");			
			КонецЕсли;			
			Если ЭлементФормыДляОбновления <> Неопределено Тогда
				ЭлементФормыДляОбновления.Обновить();
			КонецЕсли;	
		КонецеСли;
		
		
		
		Если ПоменятьМестами Тогда
			КолПопыток = 1;
			ПривязкаВыполнена = Ложь;
			Пока КолПопыток < 4 Цикл		
				Попытка
					МаршрутизацияЗаказовСервер.ПривязатьДанныеПоРейсуКЗаборамНаСервере(ВыбРейс,ТекущийТранспорт,ТекущийВодитель,ТекущийЭкспедитор);
					МаршрутизацияЗаказовСервер.ПривязатьМашинунаСервере(ВыбРейс,ТекущийТранспорт,ТекущийВодитель,ТекущийЭкспедитор);
					КолПопыток = 4;
					ПривязкаВыполнена = Истина;
					Продолжить;	
				Исключение
					КолПопыток = КолПопыток + 1;
				КонецПопытки;
			КонецЦикла;
			
			Если НЕ ПривязкаВыполнена Тогда	
				Сообщить("Привязка не выполнена!");			
			КонецЕсли;	
			Если ЭлементФормыДляОбновления <> Неопределено Тогда
				ЭлементФормыДляОбновления.Обновить();
			КонецЕсли;	
		КонецЕсли;
		
	КонецеСли;	
КонецПроцедуры	

Процедура ВыбратьЭкипажДляРейсаТест(Рейс, ДатаПланирования, Транспорт, ТекущийВодитель, ТекущийЭкспедитор, ФормаВладелец, ЭлементФормыДляОбновления = Неопределено) Экспорт
	Фрм = ПолучитьФорму("Документ.РейсТест.Форма.ФормаВыбораТранспорта", Новый Структура("РежимВыбора, ДатаРейса, Транспорт", Истина, КонецДня(ДатаПланирования), Транспорт), ФормаВладелец);
	Струк = Фрм.ОткрытьМодально();
	Если ЗначениеЗаполнено(Струк) Тогда
		
		ВыбТранспорт = Струк.Транспорт;
		ВыбВодитель = Струк.Водитель;
		ВыбЭкспедитор = Струк.Экспедитор;
		ВыбРейс = Струк.Рейс;
		ПоменятьМестами = Струк.ПоменятьМестами;
		
		ТекущийТранспорт = Транспорт;
		
		//ТекущийТранспорт = Элементы.Список.ТекущиеДанные.ПривязанныйТранспорт;
		//ТекущийВодитель = Элементы.Список.ТекущиеДанные.ПривязанныйВодитель;
		//ТекущийЭкспедитор = Элементы.Список.ТекущиеДанные.ПривязанныйЭкспедитор;
		
		//+++ БАО 09.08.2017 №1606
		Если ЗначениеЗаполнено(ВыбТранспорт) И ЗначениеЗаполнено(Рейс) Тогда
			
			Струк = Новый Структура;
			Струк.Вставить("Транспорт", ВыбТранспорт);
			
			Попытка
				
				ПараметрыТранспорта = МаршрутизацияЗаказовСервер.ПрочитатьДополнительныеПараметрыТранспорта(ВыбТранспорт);
				
				Если ПараметрыТранспорта = Неопределено Тогда
					УдаленноеЗакрытиеРейсов = Ложь;
				Иначе	
					УдаленноеЗакрытиеРейсов = ПараметрыТранспорта.УдаленноеЗакрытие;
				КонецеСли;	
				
				//РейсОбъект = Рейс.ПолучитьОбъект();
				//РейсОбъект.УдаленноеЗакрытиеРейса = УдаленноеЗакрытиеРейсов;
				//РейсОбъект.Записать();
				МаршрутизацияЗаказовСервер.УстановитьДляРейсаПризнакУдаленногоЗакрытия(Рейс, УдаленноеЗакрытиеРейсов);
				Если ЭлементФормыДляОбновления <> Неопределено Тогда
					ЭлементФормыДляОбновления.Обновить();
				КонецЕсли;	
				
			Исключение
				Ош = ОписаниеОшибки();
				Сообщить("Ошибка установки реквизита Удаленное закрытие рейса. Действие отменено. Попробуйте еще раз.");
				Возврат;
				
			КонецПопытки;	
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ВыбТранспорт) Тогда
			КолПопыток = 1;
			ПривязкаВыполнена = Ложь;
			Пока КолПопыток < 4 Цикл		
				Попытка
					МаршрутизацияЗаказовСервер.ПривязатьДанныеПоРейсуКЗаборамНаСервереТест(Рейс, ВыбТранспорт, ВыбВодитель, ВыбЭкспедитор);
					МаршрутизацияЗаказовСервер.ПривязатьМашинунаСервереТест(Рейс, ВыбТранспорт, ВыбВодитель, ВыбЭкспедитор);
					КолПопыток = 4;
					ПривязкаВыполнена = Истина;
					Продолжить;	
				Исключение
					КолПопыток = КолПопыток + 1;
				КонецПопытки;
			КонецЦикла;	
			
			Если НЕ ПривязкаВыполнена Тогда	
				Сообщить("Привязка не выполнена!");			
			КонецЕсли;			
			Если ЭлементФормыДляОбновления <> Неопределено Тогда
				ЭлементФормыДляОбновления.Обновить();
			КонецЕсли;	
		КонецеСли;
		
		
		
		Если ПоменятьМестами Тогда
			КолПопыток = 1;
			ПривязкаВыполнена = Ложь;
			Пока КолПопыток < 4 Цикл		
				Попытка
					МаршрутизацияЗаказовСервер.ПривязатьДанныеПоРейсуКЗаборамНаСервереТест(ВыбРейс,ТекущийТранспорт,ТекущийВодитель,ТекущийЭкспедитор);
					МаршрутизацияЗаказовСервер.ПривязатьМашинунаСервереТест(ВыбРейс,ТекущийТранспорт,ТекущийВодитель,ТекущийЭкспедитор);
					КолПопыток = 4;
					ПривязкаВыполнена = Истина;
					Продолжить;	
				Исключение
					КолПопыток = КолПопыток + 1;
				КонецПопытки;
			КонецЦикла;
			
			Если НЕ ПривязкаВыполнена Тогда	
				Сообщить("Привязка не выполнена!");			
			КонецЕсли;	
			Если ЭлементФормыДляОбновления <> Неопределено Тогда
				ЭлементФормыДляОбновления.Обновить();
			КонецЕсли;	
		КонецЕсли;
		
	КонецеСли;	
КонецПроцедуры
